{"Symptoms":{"0":"Symptoms on fruit are similar to those found on leaves. Scabby spots are sunken and tan and may have velvety spores in the center. As these spots mature, they become larger and turn brown and corky. Infected fruit becomes distorted and may crack allowing entry of secondary organisms. Severely affected fruit may drop, especially when young.","1":"Black rot is a disease of apples that infects fruit, leaves, and bark caused by the fungus Botryosphaeria obtusa.Early symptoms are often limited to leaf symptoms such as purple spots on upper leaf surfaces. As these spots age, the margins remain purple, but the centers dry out and turn yellow to brown. Over time, the spots expand and heavily infected leaves drop from the tree. Infected branches or limbs will show characteristic red-brown sunken areas that expand each year.\n\n","2":"Cedar apple rust (Gymnosporangium juniperi-virginianae) is a fungal disease that requires juniper plants to complete its complicated two year life-cycle. Spores overwinter as a reddish-brown gall on young twigs of various juniper species.  On apple and crab-apple trees, look for pale yellow pinhead sized spots on the upper surface of the leaves shortly after bloom. These gradually enlarge to bright orange-yellow spots which make the disease easy to identify. Orange spots may develop on the fruit as well. Heavily infected leaves may drop prematurely.","3":null,"4":null,"5":null,"6":"powdery mildew is a fungal disease found throughout the United States. It is caused by a variety of closely related fungal species, each with a limited host range.Low soil moisture combined with high humidity levels at the plant surface favors this disease.Symptoms usually appear later in the growing season on outdoor plants. Powdery mildew starts on young leaves as raised blister-like areas that cause leaves to curl, exposing the lower leaf surface. Infected leaves become covered with a white to gray powdery growth, usually on the upper surface; unopened flower buds may be white with mildew and may never open. Leaves of severely infected plants turn brown and drop. The disease prefers young, succulent growth; mature leaves are usually not affected.\n\n","7":null,"8":"One of the most common symptoms of this Cercospora leaf spot disease attack on crops is when you notice round spots with a light grey center and a deep brown margin surrounded by a yellow ring. The leaves later turns yellow then wilt and fall. On stems, elongated spots can be seen as they appear and the circular blemishes typically have an average diameter of 3 millimeters that is between brown and reddish-purple in color, bordering a gray center.                                                                                                                                                                        Initial leaf infestation appears as tiny to slightly elongated, roughly parallel-sided spots with yellow margins. The later stage of infestation shows rectangular tan to gray spots that remain evident on completely blighted leaves. The fungal growth on the lesions gave a characteristic grayish cast.","9":"Common rust is caused by the fungus Puccinia sorghi and occurs every growing season. It is seldom a concern in hybrid corn. Rust pustules usually first appear in late June. Early symptoms of common rust are chlorotic flecks on the leaf surface. These soon develop into powdery, brick-red pustules as the spores break through the leaf surface. Pustules are oval or elongated, about 1\/8 inch long, and scattered sparsely or clustered together. The leaf tissue around the pustules may become yellow or die, leaving lesions of dead tissue. The lesions sometimes form a band across the leaf and entire leaves will die if severely infected. As the pustules age, the red spores turn black, so the pustules appear black, and continue to erupt through the leaf surface. Husks, leaf sheaths, and stalks also may be infected.","10":"Northern corn leaf blight (NCLB) is caused by the fungus Setosphaeria turcica. Symptoms usually appear first on the lower leaves. Leaf lesions are long (1 to 6 inches) and elliptical, gray-green at first but then turn pale gray or tan. Under moist conditions, dark gray spores are produced, usually on the lower leaf surface, which give lesions a \"dirty\" gray appearance. Entire leaves on severely blighted plants can die, so individual lesions are not visible. Lesions may occur on the outer husk of ears, but the kernels are not infected. On hybrids that contain an Ht gene for resistance to the fungus, lesions are smaller, chlorotic, and may develop into linear streaks. These lesions rarely produce spores. \"Cigar-shaped\" northern corn leaf blight lesions.","11":null,"12":"The disease attacks the leaves, stem, flowers and berries. All the new growth on the vineis prone to attack during the growing season.\nThe symptoms are in the form of irregularly shapedreddish brown spots on the leaves and a black scab on berries.\nOccasionally, small elliptical darkcoloured canker lesions occur on the young stems and tendrils. Leaf, cane and tendril infection canoccur only when the tissue is young, but berries can be infected until almost fully-grown if an activefungicide residue is not present.\nThe affected berries shrivel and become hard black mummies.","13":"Symptom appears on leaves, trunk, canes and berries. On leaves we will see intervenaial striping looks like tiger strips. White cultivars shows chlorotic and necrotic strips where as red cultivars shows red areas and necrotic strips. On berries we will see superficial spots and later may coalesce making berries appear black. Trunk\/arm\/cordons shows dark brown black vascular streaking and oozes dark sap when we cut trunk. Some time this measles in associate with numerous secondary wood rotting fungi which decorate the vineyard completely.","14":"On leaf surface we will see lesions which are irregularly shaped (2 to 25 mm in diameter). Initially lesions are dull red to brown in color turn black later. If disease is severe this lesions may coalesce. On berries we can see symptom similar to black rot but the entire clusters will collapse.","15":null,"16":"Leaf symptoms of citrus greening include yellowing of one limb or one area of canopy, yellowing of leaf veins; blotchy mottling and\/or green islands (spots) surrounded by completely yellow leaf tissue; twig and limbs begin to die back; fruits may drop prematurely and are often mishappen and lopsided; fruit has a bitter, salty taste","17":"Water soaked, angular gray lesions on the underside of the leaves which turn purple and necrotic in the center and cause a shot hole appearance if lesion center drops out; if lesions are present in high numbers on leaves they may become chlorotic and drop from tree; cankers develop on twigs either as raised blisters or as a dark area surrounding a bud that fails to open; in years of severe infection the entire fruit crop may be lost; lesions on fruit begin as small brown, water-soaked lesions which may exude gum","18":null,"19":"Water-soaked lesions that dry out and turn brown forming on the underside of the leaves; raised brown cankers on stems; cracked brown lesions on fruit.","20":null,"21":"Early blight overwinters on infected plant tissue and is spread by splashing rain, irrigation, insects and garden tools. The disease is also carried on tomato seeds and in potato tubers. In spite of its name, early blight can occur any time throughout the growing season. High temperatures (80-85˚F.) and wet, humid conditions promote its rapid spread. In many cases, poorly nourished or stressed plants are attacked","22":"This disease is caused by a fungus called Phytopthora infestans.\nThe disease may attack almost any time after the crop has put up fairly good foliage.\nInitially, the lower leaves are infected. They show water-soaked lesions, especially towards margins. The spots enlarge if proper humidity and temperature are available.\nIn humid atmosphere, the growth of the fungus can be seen on lower side of these spots as whitish cottony growth. The spots turn black as the affected leaves start rotting.\nThe tubers under the ground also decay before harvest. On tubers, greenish sunken areas may be seen.\nCool humid atmosphere favours the disease and prevalence of such weather can be an indication of disease in a short time ahead.","23":null,"24":null,"25":null,"26":"Symptoms usually appear later in the growing season on outdoor plants. Powdery mildew starts on young leaves as raised blister-like areas that cause leaves to curl, exposing the lower leaf surface. Infected leaves become covered with a white to gray powdery growth, usually on the upper surface; unopened flower buds may be white with mildew and may never open. Leaves of severely infected plants turn brown and drop. The disease prefers young, succulent growth; mature leaves are usually not affected.","27":"Irregular dark purple or brown blotches on upper leaf surface which may colaesce to produce large purplish brown patches; tissue between blotches may turn purple or red; lesions may also develop on flowers and fruits; affected petals may wither and drop from plant; lesions may girdle peduncles causing death of fruit.","28":null,"29":"Bacterial spot occurs on peppers and tomatoes. Many of the disease features are similar for both crops. The focus of the information presented here is on pepper. Worldwide, 16.5 million metric tons (36 million tons) of peppers are grown for fresh consumption and for use in condiments. For many people in the U.S., the bell-shaped pepper fruit is the most familiar; however, non-bell-type peppers  are more widely grown.","30":"Initially, small dark spots form on older foliage near the ground.\nLeaf spots are round, brown and can grow up to half inch in diameter.\nLarger spots have target-like concentric rings. The tissue around spots often turns yellow.\nSeverely infected leaves turn brown and fall off, or dead, dried leaves may cling to the stem.Stem infections on older plants are oval to irregular, dry brown areas with dark brown concentric rings.Disease develops at moderate to warm (59 to 80 F) temperatures; 82 to 86 F optimum","31":"Late blight first appears on the lower, older leaves as water-soaked, gray-green spots. As the disease matures, these spots darken and a white fungal growth forms on the undersides. Eventually the entire plant will become infected. Crops can be severely damaged","32":"The oldest leaves are infected first.\nPale greenish-yellow spots, usually less than 1\/4 inch, with no definite margins, form on upper sides of leaves.\nOlive-green to brown velvety mold forms on the lower leaf surface below leaf spots.\nLower side of tomato leaf with olive-green to brown velvety mold below leaf spots on upper side.\nOlive green to brown velvety sporulation on the lower leaf surface\nLeaf spots grow together and turn brown. Leaves wither and die but often remain attached to the plant.\nRow of tomato plants, lower two thirds of plants have dead, brown leaves\nLeaf death caused by severe leaf mold infection\nInfected blossoms turn black and fall off.","33":"Septoria leaf spot usually appears on the lower leaves after the first fruit sets. Spots are circular, about 1\/16 to 1\/4 inch in diameter with dark brown margins and tan to gray centers with small black fruiting structures. Characteristically, there are many spots per leaf. This disease spreads upwards from oldest to youngest growth. If leaf lesions are numerous, the leaves turn slightly yellow, then brown, and then wither. Fruit infection is rare.","34":"The underside of the leaves also have yellow discoloration or bronzing or appearance of sandblasting. The plants may turn yellow and leaves may drop exposing fruits to sunscalding.Under severe infestation from spider mites webbing can be seen on leaves. Severe bronzing of leaves can happen at this stage which could significantly affect yield.Spider mites are very tiny and can be seen on underside of the leaves. During heavy infestation spider mites can be seen all over the plant.Spider mites suck the juice form the plant and feeding sites show symptoms of yellow blotching. These sections may turn brown and dessicate later.Spider mite feeding can cause numerous yellow or white tiny granulated spots on tomato leaves. The infestation mostly occurs under hot and dry conditions.","35":"Target spot symptoms begin as small dark lesions which enlarges to form light brown lesions with concentric pattern and a yellow halo around it in the transplants.Lesions can be seen inside the canopy and the micro-climate favors the infection process. The lesions on infected plants can become very large and cover significant area of the leaf in the field.Easily stages symptoms start as many pink prick lesions which are very hard to separate from bacterial spot and many fungal leaf spot diseases.Target spot like appearance of the lesion which is characteristic symptom of the disease. The tissue in the infected regions of the leaves becomes necrotic and severely affects photosynthesis.","36":"Leaves of infected plants are small and curl upward; and show strong crumpling and interveinal and marginal yellowing. The internodes of infected plants become shortened and, together with the stunted growth, plants often take on a bushy appearance, which is sometimes referred to as 'bonsai' or broccoli'-like growth. Flowers formed on infected plants commonly do not develop and fall off (abscise). Fruit production is dramatically reduced, particularly when plants are infected at an early age, and it is not uncommon for losses of 100% to be experienced in fields with heavily infected plants.","37":"Yellow, white or green stripes\/ streaks\/ spots on foliage\nWrinkled, curled or small leaves\nPronounced yellowing only of veins\nStunted growth and reduced yields\nInfected fruit appears mottled and develops raised “warty” a"},"Treatment ":{"0":"1. Rake under trees and destroy infected leaves to reduce the number of fungal spores available to start the disease cycle over again next spring.\n2. Water in the evening or early morning hours (avoid overhead irrigation) to give the leaves time to dry out before infection can occur.\n3. Spread a 3- to 6-inch layer of compost under trees, keeping it away from the trunk, to cover soil and prevent splash dispersal of the fungal spores.\n4. For best control, spray liquid copper soap early, two weeks before symptoms normally appear. Alternatively, begin applications when disease first appears, and repeat at 7 to 10 day intervals up to blossom drop.","1":"1. Treating black rot on apple trees starts with sanitation. Because fungal spores overwinter on fallen leaves, mummified fruits, dead bark, and cankers, it’s important to keep all the fallen debris and dead fruit cleaned up and away from the tree.\n2. Once black rot disease is under control in your tree and you’re again harvesting healthy fruits, make sure to remove any injured or insect-invaded fruits to avoid re-infection. Although general-purpose fungicides, like copper-based sprays and lime sulfur, can be used to control black rot, nothing will improve apple black rot like removing all sources of spor","2":"1. Dispose of fallen leaves and other debris from under trees.\n2. Remove galls from infected junipers. In some cases, juniper plants should be removed entirely.\n3.Apply preventative, disease-fighting fungicides labeled for use on apples weekly, starting with bud break, to protect trees from spores being released by the juniper host. This occurs only once per year, so additional applications after this springtime spread are not necessary.\n4.On juniper, rust can be controlled by spraying plants with a copper solution (0.5 to 2.0 oz\/ gallon of water) at least four times between late August and late October.                                            5. Containing sulfur and pyrethrins, Bonide Orchard Spray is a safe, one-hit concentrate for insect attacks and fungal problems. For best results, apply as a protective spray (2.5 oz\/ gallon) early in the season.                                                         ","3":null,"4":null,"5":null,"6":"1. Plant resistant cultivars in sunny locations whenever possible.\n2. Prune or stake plants to improve air circulation. Make sure to disinfect your pruning tools (one part bleach to 4 parts water) after each cut.\n3. Remove diseased foliage from the plant and clean up fallen debris on the ground.\n4. Use a thick layer of mulch or organic compost to cover the soil after you have raked and cleaned it well. Mulch will prevent the disease spores from splashing back up onto the leaves.\n5. Milk sprays, made with 40% milk and 60% water, are an effective home remedy for use on a wide range of plants. For best results, spray plant leaves as a preventative measure every 10-14 days.","7":null,"8":"1. Always use healthy seeds.\n2. Remove all crop residues, weeds and infested plants.\n3. Avoid overhead watering otherwise water early in the morning.\n4. Apply fungicides on the foliage in case of early symptoms.\n5. Implement crop rotation by alternating with plants such as sorghum, corn or fodder plants.       6.Removal and proper disposal of infected plants. Burn infected plant tissues when possible.","9":"1. Select rust-resistant plant varieties when available.\n2. Pick off and destroy infected leaves and frequently rake under plants to remove all fallen debris.\n3.Water in the early morning hours — avoiding overhead sprinklers — to give plants time to dry out during the day. Drip irrigation and soaker hoses can be used to help keep leaves dry.\n4. Use a slow-release, organic fertilizer on crops and avoid excess nitrogen. Soft, leafy, new growth is most susceptible.\n5.Apply copper sprays or sulfur powders to prevent infection of susceptible plants. For best results, apply early or at first sign of disease. Spray all plant parts thoroughly and repeat every 7-10 days up to the day of harvest.\n6. Effectively treat fungal diseases with SERENADE Garden. This broad spectrum bio-fungicide uses a patented strain of Bacillus subtilis and is approved for organic gardening. Best of all, it’s safe to use — you can treat and pick crops the s","10":" If possible, planting in low areas that receive heavy dew and fog should be avoided. A combination of crop rotation for one to two years followed by tillage is recommended to prevent NCLB disease development.\nThe use of foliar fungicides for corn have also been shown to control NCLB. Research suggests that using fungicides to keep the upper 75% of the leaf canopy disease-free for three quarters of the grain-filling period will eliminate yield loss  To ensure that newly emerging leaf tissue is protected from infection, before the plants are in tassel, fungicides should be applied on the same day that significant conidial dispersal is expected to occur. After tasseling and silking, timing becomes less important since plant expansion will have slowed down. The disease pressure in the field and weather conditions should be monitored and evaluated beforehand to determine if fungicides are needed or not.","11":null,"12":"The best time to treat black rot of grapes is between bud break until about four weeks after bloom; treating outside of this window is likely to end in frustration\n\nDuring your fall clean-up, make sure that all mummies have been removed from the vine and all plant material on the ground below is destroyed. Prune out any and all areas with lesions; grapevines can handle a severe pruning — when in doubt, cut it out. If leaves appear the following spring with new lesions, remove these immediately and start a spray treatment program.","13":"Till date there is no effective method to control this disease. Remove the infected berries, leaves and trunk and destroy them. Protect the prune wounds to minimize fungal infection using wound sealant (5% boric acid in acrylic paint) or essential oil or suitable fungicides.","14":"Fungicides sprayed for other diseases in the season may help to reduce this disease.","15":null,"16":"1. strict quarantining to prevent the introduction of citrus psyllids to areas which are currently free of the pest. Areas which are subject to quarantine have restrictions placed on the movement of citrus plants, fruit, equipment and items made from citrus. Infected trees should be removed as quickly as possible from plantations and destroyed. Identification of infected trees should be achieved through several surveys to ensure that infected trees which are not yet showing symptoms are identified. In Florida, the recommendation is to scout groves at least 4 times a year for disease symptoms. Control of citrus psyllids Citrus psyllid populations can be controlled through the application of chemical sprays. Insecticides have proved very effective at controlling T. eryreae in South Africa where systemic insecticides are applied to the tree at the base of the trunk. In areas of the USA, Citrus health management areas (CHMAs) have been created to encourage neighbouring growers to work together to prevent the disease. Control strategies which have been implemented by the program include scouting, mapping and large-scale spraying to control citrus psyllids.","17":"Avoid planting susceptible peach varieties in areas where disease is known; once disease is visible it can be difficult to control, protective copper applications in the Fall prior to leaf drop and\/or application in early growing season may help prevent the disease; care should be taken as peach trees are very sensitive to copper.","18":null,"19":"Use disease free planting material; remove and destroy all crop debris after harvest, or plow material deeply under soil.","20":null,"21":"1. Prune or stake plants to improve air circulation and reduce fungal problems.\n2. Make sure to disinfect your pruning shears (one part bleach to 4 parts water) after each cut.\n3. Keep the soil under plants clean and free of garden debris. Add a layer of organic compost to prevent the spores from splashing back up onto vegetation.\n4. Drip irrigation and soaker hoses can be used to help keep the foliage dry.\n5. For best control, apply copper-based fungicides early, two weeks before disease normally appears or when weather forecasts predict a long period of wet weather. Alternatively, begin treatment when disease first appears, and repeat every 7-10 days for as long as needed.","22":"Use potato tubers for seed from disease-free areas to ensure that the pathogen is not carried through seed tuber.\nThe infected plant material in the field should be properly destroyed.\nGrow resistant varieties like Kufri Navtal.\nFungicidal sprays on the appearance of initial symptoms. Spraying should be done with Dithane M-45 or Dithane Z-78 (2.5 kg\/I 000 litres of water per hectare). Spraying should be repeated at 10-12 days' interval.","23":null,"24":null,"25":null,"26":"Plant in sites with good air circulation and sun exposure; do not overcrowd plants; sanitize equipment regularly.Two biopesticides Regalia SC and HMO 736 were evaluated in the greenhouse and field for their efficacy against powdery mildew in squash.","27":"Plant resistant varieties; regular renewal of plants; plant in an area with good air circulation and drainage in full sun; remove all foliage from plants at harvest; application of appropriate foliar fungicide may be required to provide control.","28":null,"29":"A plant with bacterial spot cannot be cured.  Remove symptomatic plants from the field or greenhouse to prevent the spread of bacteria to healthy plants.  Burn, bury or hot compost the affected plants and DO NOT eat symptomatic fruit.  Although bacterial spot pathogens are not human pathogens, the fruit blemishes that they cause can provide entry points for human pathogens that could cause illness.Plant pathogen-free seed or transplants to prevent the introduction of bacterial spot pathogens on contaminated seed or seedlings.  If a clean seed source is not available or you suspect that your seed is contaminated, soak seeds in water at 122°F for 25 min. to kill the pathogens","30":"Use pathogen-free seed, or collect seed only from disease-free plants.\nRotate out of tomatoes and related crops for at least two years.\nControl susceptible weeds such as black nightshade and hairy nightshade, and volunteer tomato plants throughout the rotation.\nFertilize properly to maintain vigorous plant growth. Particularly, do not over-fertilize with potassium and maintain adequate levels of both nitrogen and phosphorus.\nAvoid working in plants when they are wet from rain, irrigation, or dew.\nUse drip irrigation instead of overhead irrigation to keep foliage dry.\nStake the plants to increase airflow around the plant and facilitate drying. Staking will also reduce contact between the leaves and spore-contaminated soil.\nApply plastic or organic mulch to reduce humidity and provide a barrier between contaminated soil and leaves.","31":"Plant resistant cultivars when available.\nRemove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation.\nWater in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation.\nDestroy all tomato and potato debris after harvest (see Fall Garden Cleanup","32":"Use drip irrigation and avoid watering foliage.\nSpace plants to provide good air movement between rows and individual plants.\nStake, string or prune to increase airflow in and around the plant.                                                 Remove crop residue at the end of the season. Burn it or bury it away from tomato production areas.\nClean the high tunnel or greenhouse walls and benches at the end of the season with a commercial sanitizer.                                                      Applications should be made prior to infection when environmental conditions favor disease to be the most effective. The first leaf mold infections of the season have been observed in the first week of June in Minnesota high tunnel tomatoes.","33":"1. Remove diseased leaves. \n2. Improve air circulation around the plants. If the plants can still be handled without breaking them, stake or cage the plants to raise them off the ground and promote faster drying of the foliage.\n3. Mulch around the base of the plants. Mulching will reduce splashing soil, which may contain fungal spores associated with debris. Apply mulch after the soil has warmed.\n4. Do not use overhead watering. \n5. Control weeds. Nightshade and horsenettle are frequently hosts of Septoria leaf spot and should be eradicated around the garden site.\n6. Use crop rotation. \n7. Use fungicidal sprays. Apply at 7 to 10 day intervals throughout the season. Apply chlorothalonil, maneb, macozeb, or a copper-based fungicide, such as Bordeaux mixture, copper hydroxide, copper sulfate, or copper oxychloride sulfate. Follow harvest restrictions listed on the pesticide label.","34":"Avoid weedy fields and do not plant eggplant adjacent to legume forage crops.\nAvoid early season, broad-spectrum insecticide applications for other pests.\nDo not over-fertilize.\nOverhead irrigation or prolonged periods of rain can help reduce populations.                                            Selective products which have worked well in the field include:\nbifenazate (Acramite): Group UN, a long residual nerve poison\nabamectin (Agri-Mek): Group 6, derived from a soil bacterium\nspirotetramat (Movento): Group 23, mainly affects immature stages\nspiromesifen (Oberon 2SC): Group 23, mainly affects immature stages","35":"Many fungicides are registered to control of target spot on tomatoes. Growers should consult regional disease management guides for recommended products. Products containing chlorothalonil, mancozeb, and copper oxychloride have been shown to provide good control of target spot in research trials. The strobilurin fungicides azoxystrobin and pyraclostrobin, the fungicide boscalid, and the systemic acquired resistance (SAR) elicitor acibenzolar-S-methyl have also been shown to provide good control of target spot.","36":"Sanitation is very important for preventing the migration of whitefly adults and the spread of TYLCV. Rogue tomato or pepper plants with early symptoms of TYLCV can be removed from fields by placing infected-looking plants in plastic bags immediately at the beginning season, especially during first three to four weeks. Maintain good weed control in the field and surrounding areas. Prevent the spread of any whiteflies to healthy plants. Tomato and pepper fields should be cleaned up immediately after harvest. Also destroy crop residues of melons and cotton immediately after harvest to reduce whitefly migration.","37":"Spot treat with least-toxic, natural pest control products, such as Safer Soap, Bon-Neem and diatomaceous earth, to reduce the number of disease carrying insects.\nHarvest-Guard row cover will help keep insect pests off vulnerable crops\/ transplants and should be installed until bloom.\nRemove all perennial weeds, using least-toxic herbicides, within 100 yards of your garden plot.\nThe virus can be spread through human activity, tools and equipment. Frequently wash your hands and disinfect garden tools, stakes, ties, pots, greenhouse benches, etc. (one part bleach to 4 parts water) to reduce the risk of contamination.\nAvoid working in the garden during damp conditions (viruses are easily spread when plants are wet).\nAvoid using tobacco around susceptible plants. Cigarettes and other tobacco products may be infected and can spread the virus."},"Disease_name":{"0":"Apple___Apple_scab","1":"Apple___Black_rot","2":"Apple___Cedar_apple_rust","3":"Apple___healthy","4":"Blueberry___healthy","5":"Cherry_(including_sour)___Powdery_mildew","6":"Cherry_(including_sour)___healthy","7":"Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot","8":"Corn_(maize)___Common_rust_","9":"Corn_(maize)___Northern_Leaf_Blight","10":"Corn_(maize)___healthy","11":"Grape___Black_rot","12":"Grape___Esca_(Black_Measles)","13":"Grape___Leaf_blight_(Isariopsis_Leaf_Spot)","14":"Grape___healthy","15":"Orange___Haunglongbing_(Citrus_greening)","16":"Peach___Bacterial_spot","17":"Peach___healthy","18":"Pepper,_bell___Bacterial_spot","19":"Pepper,_bell___healthy","20":"Potato___Early_blight","21":"Potato___Late_blight","22":"Potato___healthy","23":"Raspberry___healthy","24":"Soybean___healthy","25":"Squash___Powdery_mildew","26":"Strawberry___Leaf_scorch","27":"Strawberry___healthy","28":"Tomato___Bacterial_spot","29":"Tomato___Early_blight","30":"Tomato___Late_blight","31":"Tomato___Leaf_Mold","32":"Tomato___Septoria_leaf_spot","33":"Tomato___Spider_mites Two-spotted_spider_mite","34":"Tomato___Target_Spot","35":"Tomato___Tomato_Yellow_Leaf_Curl_Virus","36":"Tomato___Tomato_mosaic_virus","37":"Tomato___healthy"}}